public class HW9 {

    //new test :git add /git commit/ git push
//    Создать алгоритм OddEven, который принимает на вход целое число,
//    возвращает “Odd”,  если число нечетное, и “Even”, если число четное.
//    Во всех остальных случаях результат будет “Undefined”.
//
//    Test Data:
//            -345 →  “Odd”
//            0 →  “Even”
//            222222 →  “Even”
//            2147483647 + 1 →  “Undefined”

    public static void OddEven( int n) {
        if ( n % 2 != 0 ) {
            System.out.println("Odd");
        } else {
            System.out.println("Even");
        }
    }


















}
